export const dialogText = {
  confirm: {
    category: {
      title: "Ви дійсно хочете видалити категорію?",
      text: "Категорія, буде видалена назавжди. Цю дію не можна відмінити.",
    },
    unit: {
      title: "Ви дійсно хочете видалити структурний підрозділ?",
      text: "Структурний підрозділ буде видалено назавжди. Цю дію не можна відмінити.",
    },
    groups: {
      title: "Ви дійсно хочете видалити групу?",
      text: "Група, включаючи все навчальне навантаження, розклад та студентів, що зараховані до групи, будуть видалені назавжди. Цю дію не можна відмінити.",
    },
    groups_open_stream_page: {
      title: "Редагування потоків",
      text: 'Ви дійсно хочете перейти на сторінку "Потоки"? Всі внесені зміни не буде збережено',
    },
    auditories: {
      title: "Ви дійсно хочете видалити аудиторію?",
      text: "Аудиторія буде видалена назавжди. Цю дію не можна відмінити.",
    },
    cmk: {
      title: "Ви дійсно хочете видалити циклову комісію?",
      text: "Циклову комісію буде видалена назавжди. Цю дію не можна відмінити.",
    },
    teachers: {
      title: "Ви впевнені, що хочете видалити викладача?",
      text: "Викладач, буде видалений назавжди. Цю дію не можна відмінити.",
    },
    streams: {
      title: "Ви дійсно хочете видалити потік?",
      text: "Потік буде видалено назавжди. Цю дію не можна відмінити.",
    },
    students: {
      title: "Ви дійсно хочете видалити студента?",
      text: "Студент та всі результати навчання пов'язані з ним будуть видалені назавжди. Цю дію не можна відмінити.",
    },
    plan_change: {
      title: "Ви змінюєте навчальний план",
      text: "Усі дані попереднього навантаження будуть видалені, і на їх місці буде автоматично згенеровано нове навантаження згідно з обраним навчальним планом.",
    },
    plan_delete: {
      title: "Ви дійсно хочете видалити навчальний план?",
      text: "Навчальний план, буде видалений назавжди. Цю дію не можна відмінити.",
    },
    plan_hours_delete: {
      title: "Ви дійсно хочете видалити години навчального семестру?",
      text: "Зверніть увагу, що якщо вже сформовано навчальне навантаження для групи на основі плану, навантаження групи може бути також видалене. Години семестру, будуть видалені назавжди. Цю дію не можна відмінити.",
    },
    accounts: {
      title: "Ви дійсно хочете видалити користувача?",
      text: "Користувач, буде видалений назавжди. Цю дію не можна відмінити.",
    },
  },
  alert: {
    distribution_teacher: {
      title: "Помилка",
      text: "Викладач для закріплення за дисципліною не вибраний",
    },
    group: {
      title: "Група не знайдена",
      text: "Група, яку ви намагаєтеся видалити, не знайдена. Можливо, вона була видалена раніше.",
    },
    teacher: {
      title: "Викладач не знайдений",
      text: "Викладач, якого ви намагаєтеся видалити, не знайдений. Можливо, він був видалений раніше.",
    },
    stream_delete: {
      title: "Видалення потоку неможливе",
      text: "Потік не може бути видалений, оскільки він містить пов’язані групи. Перед видаленням потоку необхідно спочатку видалити або перемістити всі групи, які до нього належать.",
    },
    plan_delete: {
      title: "Видалення категорії неможливе",
      text: "Категорія не може бути видалена, оскільки вона містить пов’язані навчальні плани. Перед видаленням категорії необхідно спочатку видалити або перемістити всі навчальні плани, які до неї належать.",
    },
    auditory_category_delete: {
      title: "Видалення категорії неможливе",
      text: "Категорія не може бути видалена, оскільки вона містить пов’язані аудиторії. Перед видаленням категорії необхідно спочатку видалити або перемістити всі аудиторії, які до неї належать.",
    },
    group_category_delete: {
      title: "Видалення структурного підрозділу неможливе",
      text: "Підрозділ не може бути видалений, оскільки він містить пов’язані групи. Перед видаленням структурного підрозділу необхідно спочатку видалити або перемістити всі групи, які до нього належать.",
    },
    teacher_category_delete: {
      title: "Видалення циклової комісії неможливе",
      text: "Циклова комісія не може бути видалена, оскільки вона містить пов’язаних викладачів. Перед видаленням циклової необхідно спочатку видалити або перемістити всіх викладачів, які до неї належать.",
    },
  },
}
